app/Controllers/Api/CashRegisters.php

SELECT *
FROM `cash_registers`
ORDER BY `id_cash_register` DESC
 LIMIT 20
---
            $total = (int) $countBuilder->countAllResults();

            $offset = ($page - 1) * $perPage;
            $items = $builder->orderBy('id_cash_register', 'DESC')
                             ->findAll($perPage, $offset);