app/Controllers/Api/Shifts.php

SELECT *
FROM `shifts`
WHERE `id_contador` = 3
AND `id_empresa` = 4
ORDER BY `id_shift` DESC
 LIMIT 50
---
    public function index()
    {
        $session = session();
        $builder = $this->model;
        if ($session->get('id_contador')) {
            $builder = $builder->where('id_contador', (int) $session->get('id_contador'));
        }
        if ($session->get('id_empresa')) {
            $builder = $builder->where('id_empresa', (int) $session->get('id_empresa'));
        }
        $items = $builder->orderBy('id_shift', 'DESC')->findAll(50);