app/Controllers/Contadores.php

    public function index()
    {
        // Verifica se o usuário tem permissão de acessar essa url
        if($retorno = verificaPermissaoDeAcesso($this->tipo)) :
            return redirect()->to($retorno);
        endif;

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Contadores',
            'icone'  => 'fa fa-user-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Contadores", 'rota'   => "", 'active' => true]
        ];

        $data['contadores'] = $this->contador_model
                                            ->findAll();
---
SELECT *
FROM `contadores`