app/Controllers/Empresas.php

SELECT *
FROM `empresas`
WHERE `id_contador` = '1'
---

        else:

            $data['empresas'] = $this->empresa_model
                                    ->where('id_contador', $this->id_contador)
                                    ->findAll();