app/Controllers/Login.php

    public function autenticar()
    {
        // Throttle por IP: 5 tentativas por minuto
        $throttler = service('throttler');
        $ipKey = 'login-' . $this->request->getIPAddress();
        if (!$throttler->check($ipKey, 5, MINUTE)) {
            $this->session->setFlashdata(
                'alert',
                [
                    'type'  => 'error',
                    'title' => 'Muitas tentativas. Tente novamente em instantes.'
                ]
            );
            return redirect()->to('/login');
        }
        $dados = $this->request
                        ->getvar();

        $login = $this->login_model
                    ->where('usuario', $dados['usuario'])
                    ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'Test1'
 LIMIT 1

            // Upgrade de senha: se armazenada sem hash, re-hash agora
            $info = password_get_info($login['senha']);
            if (empty($info['algo'])) {
                $this->login_model
                    ->where('id_login', $login['id_login'])
                    ->set('senha', password_hash($dados['senha'], PASSWORD_DEFAULT))
                    ->update();
---
UPDATE `logins` SET `senha` = '$2y$10$D.DUeclhueON.QHxuc3NG.Vr7QjS1wrOglfThbyL/a4OErlq01Hu2', `updated_at` = '2025-09-07 20:00:48'
WHERE `id_login` = '2'


            elseif($login['tipo'] == 3) :
                // Caso o tipo for 3 (Emissor) então pega o id_empresa e valida acesso da assinatura
                $empresa = $this->empresa_model
                                ->where('id_login', $login['id_login'])
                                ->first();
---
SELECT *
FROM `empresas`
WHERE `id_login` = '5'
 LIMIT 1

    public function verificaUsuario()
    {
        $dados = $this->request
                        ->getvar();

        $usuario = $this->login_model
                        ->where('usuario', $dados['usuario'])
                        ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'GeLsolutions@proton.me'
 LIMIT 1