app/Controllers/Produtos.php

SELECT *
FROM `produtos`
JOIN `unidades` ON `produtos`.`id_unidade` = `unidades`.`id_unidade`
WHERE `id_contador` = '1'
AND `id_empresa` = '6'
ORDER BY `id_produto` DESC
 LIMIT 10
---

        else:

            $data['produtos'] = $this->produto_model
                                    ->where('id_contador', $this->id_contador)
                                    ->where('id_empresa', $this->id_empresa)
                                    ->limit(10)
                                    ->orderBy('id_produto', 'DESC')
                                    ->join('unidades', 'produtos.id_unidade = unidades.id_unidade')
                                    ->find();