app/Controllers/Relatorios.php

SELECT *
FROM `empresas`
JOIN `ufs` ON `empresas`.`id_uf` = `ufs`.`id_uf`
JOIN `municipios` ON `empresas`.`id_municipio` = `municipios`.`id_municipio`
WHERE `id_contador` = '1'
---
    public function empresas()
    {
        // Verifica se o usuário tem permissão de acessar essa url
        if($retorno = verificaPermissaoDeAcesso($this->tipo)) :
            return redirect()->to($retorno);
        endif;

        $data['link'] = '3';

        $data['titulo'] = [
            'modulo' => 'Relação de Empresas',
            'icone'  => 'fa fa-user-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio/contador", 'active' => false],
            ['titulo' => "Relatório", 'rota'   => "", 'active' => true]
        ];

        $data['empresas'] = $this->empresa_model
            ->where('id_contador', $this->id_contador)
            ->join('ufs', 'empresas.id_uf = ufs.id_uf')
            ->join('municipios', 'empresas.id_municipio = municipios.id_municipio')
            ->findAll();

SELECT COUNT(`id_empresa`) AS `id_empresa`
FROM `empresas`
WHERE `id_contador` = '1'
 LIMIT 1
SELECT *
FROM `empresas`
WHERE `id_contador` = '1'
---
    public function contadores()
    {
        $tipo = $this->session->get('tipo');

        // Verifica se o usuário tem permissão de acessar essa url
        if($retorno = verificaPermissaoDeAcesso($tipo)) :
            return redirect()->to($retorno);
        endif;

        $data['link'] = '3';

        $data['titulo'] = [
            'modulo' => 'Relação de Contadores',
            'icone'  => 'fa fa-user-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio/admin", 'active' => false],
            ['titulo' => "Relatório", 'rota'   => "", 'active' => true]
        ];

        $contadores = $this->contador_model
                            ->select('id_contador, status, nome, nome_fantasia, cnpj, status')
                            ->findAll();

        $contagem = [];

        foreach($contadores as $contador) :
            $cont = $this->empresa_model
                        ->selectCount('id_empresa')
                        ->where('id_contador', $contador['id_contador'])
                        ->first()['id_empresa'];

            $empresas = $this->empresa_model
                            ->where('id_contador', $contador['id_contador'])
                            ->findAll();