app/Controllers/Stripe.php

    public function createCheckoutSession()
    {
        $session = session();
        $idEmpresa = $session->get('id_empresa');
        if (!$idEmpresa) {
            return $this->response->setStatusCode(401)->setJSON(['error' => 'Não autenticado']);
        }

        $priceId = $this->request->getVar('price_id') ?: getenv('stripe.price') ?: getenv('STRIPE_PRICE');
        if (!$priceId) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'price_id não informado']);
        }

        $empresa = $this->empresaModel->find($idEmpresa);
---
SELECT *
FROM `empresas`
WHERE `empresas`.`id_empresa` = '3'