app/Models/BaseAppModel.php

    public function find($id = null)
    {
        if ($this->enforceTenant && $id !== null) {
            [$idContador,$idEmpresa] = $this->resolveTenantIds();
            $builder = $this->builder();

            // Verifica se a tabela possui as colunas antes de aplicar filtros
            $tableFields = $this->getTableFields();

            if ($this->tenantContadorField && $idContador > 0 && in_array($this->tenantContadorField, $tableFields)) {
                $builder->where($this->table . '.' . $this->tenantContadorField, $idContador);
            }
            if ($this->tenantEmpresaField && $idEmpresa > 0 && in_array($this->tenantEmpresaField, $tableFields)) {
                $builder->where($this->table . '.' . $this->tenantEmpresaField, $idEmpresa);
            }

            if (is_array($id)) {
                $builder->whereIn($this->primaryKey, $id);
                return $builder->get()->getResultArray();
            } else {
                $builder->where($this->primaryKey, $id);
                $result = $builder->get()->getFirstRow();
---
SELECT *
FROM `empresas`
WHERE `empresas`.`id_contador` = 1
AND `empresas`.`id_empresa` = 6
AND `id_empresa` = 6