app/Libraries/Outbox.php

    public static function record(string $table, array $primaryKey, string $operation, ?array $payload = null): void
    {
        try {
            $db = Database::connect();
            if (! $db->tableExists('outbox_events')) {
                return; // sem tabela, não falha a operação original
            }
            $db->table('outbox_events')->insert([
                'table_name'       => $table,
                'primary_key_json' => json_encode($primaryKey, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES),
                'operation'        => $operation,
                'payload'          => $payload ? json_encode($payload, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES) : null,
                'created_at'       => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `outbox_events` (`table_name`, `primary_key_json`, `operation`, `payload`, `created_at`) VALUES ('pix_transactions', '{\"id_pix_transaction\":4}', 'insert', '{\"txid\":\"PIX68DDC6024C165D723237B12CACBA1\",\"provider\":\"mercadopago\",\"amount\":10,\"qr_code\":\"pending\",\"pix_key\":\"\",\"status\":\"pending\",\"expires_at\":\"2025-10-02 00:38:30\",\"request_payload\":\"{\\\"amount\\\":10,\\\"description\\\":\\\"Venda PDV #36\\\"}\",\"id_contador\":1,\"id_empresa\":6,\"created_at\":\"2025-10-02 00:23:30\",\"updated_at\":\"2025-10-02 00:23:30\",\"id_pix_transaction\":4}', '2025-10-02 00:23:30')