app/Libraries/PixService.php

    protected function loadTenantConfig(): void
    {
        [$idContador, $idEmpresa] = $this->getTenantIds();

        $db = \Config\Database::connect();
        $config = $db->table('empresas')
                     ->where('id_contador', $idContador)
                     ->where('id_empresa', $idEmpresa)
                     ->get()
                     ->getRowArray();
---
SELECT *
FROM `empresas`
WHERE `id_contador` = 1
AND `id_empresa` = 6

                'id_empresa' => $idEmpresa,
            ];

            $idTransaction = $this->pixModel->insert($transactionData);
---
INSERT INTO `pix_transactions` (`txid`, `provider`, `amount`, `qr_code`, `pix_key`, `status`, `expires_at`, `request_payload`, `id_contador`, `id_empresa`, `created_at`, `updated_at`) VALUES ('PIX68DDC6024C165D723237B12CACBA1', 'mercadopago', 10, 'pending', '', 'pending', '2025-10-02 00:38:30', '{\"amount\":10,\"description\":\"Venda PDV #36\"}', 1, 6, '2025-10-02 00:23:30', '2025-10-02 00:23:30')